# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

mouth_list = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
mouth_dict = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето', 9: 'осень',
              10: 'осень', 11: 'осень', 12: 'зима', }
while True:
    mounth_number = input('Введите месяц в виде целого числа от 1 до 12:')
    if mounth_number.isdigit():
        mounth_number = int(mounth_number)
        if mounth_number in range(1, 13):
            break
    print('ошибка ввода, это не число от 1 до 12')
# Вывод при помощи list
print(mouth_list[mounth_number - 1])
# Вывод при помощи dict
print(mouth_dict.get(mounth_number))

